[
  {
    "semester": "Spring  2022",
    "course": {
      "name": "BEE  4760  Lec 1",
      "instructor": "Haith"
    },
    "responses": 12,
    "enrolled": 25,
    "response_rate": 48.0,
    "evaluations": [
      {
        "responses": {
          "1": 0,
          "2": 0,
          "3": 10,
          "4": 2,
          "5": 0
        },
        "total": 12,
        "mean": 3.1711,
        "question": "[Course Content] Preparation: How well prepared were you to learn the material in this course? 1. Very under prepared, more pre-requisites needed 2. Under prepared 3. Adequately prepared 4. Over prepared in some areas 5. Over prepared, material largely duplicates pre-requisites"
      },
      {
        "responses": {
          "1": 0,
          "2": 2,
          "3": 5,
          "4": 4,
          "5": 1
        },
        "total": 12,
        "mean": 3.3312,
        "question": "[Course Content] Content Organization: Did the course structure and organization facilitate your learning? 1. Very disorganized, significantly hindered my learning 2. Somewhat disorganized 3. Adequately organized 4. Well organized 5. Very well organized and structured, significantly enhanced my learning"
      },
      {
        "responses": {
          "1": 1,
          "2": 3,
          "3": 1,
          "4": 3,
          "5": 4
        },
        "total": 12,
        "mean": 3.5013,
        "question": "[Course Content] Synthesize & Apply Content: This course challenged me to synthesize ideas, think critically about the content, and apply the material to unfamiliar topics and problems. 1. Not at all 2. Occasionally 3. Every few classes 4. Many classes and assignments 5. Nearly every class and assignment"
      },
      {
        "responses": {
          "1": 0,
          "2": 1,
          "3": 2,
          "4": 6,
          "5": 2
        },
        "total": 11,
        "mean": 3.8214,
        "question": "[Course Content] Examples & Applications: Were the number and variety of examples and practical applications presented appropriate to the course content and for your learning style? 1. No, almost no examples 2. A few, but insufficient number and/or mostly trivial 3. Some, but more or higher quality would have been helpful 4. Yes, including some very good ones 5. Excellent use of examples and applications that significantly increased my understanding of the material"
      },
      {
        "responses": {
          "1": 2,
          "2": 1,
          "3": 1,
          "4": 6,
          "5": 1
        },
        "total": 11,
        "mean": 3.2721,
        "question": "[Course Delivery] Lectures: As a whole, were lectures clear, well- structured, free of significant or frequent errors, and did they appropriately cover the course content? 1. No, usually poorly done 2. Sometimes 3. Usually adequate 4. Usually good 5. Nearly always very good"
      },
      {
        "responses": {
          "1": 1,
          "2": 2,
          "3": 0,
          "4": 3,
          "5": 5
        },
        "total": 11,
        "mean": 3.8222,
        "question": "[Course Delivery] Context: Did the lecturer motivate the course content and place it in the context of your major or your overall engineering education (beyond fulfilling a degree requirement)? 1. No 2. Somewhat 3. Adequately 4. Mostly 5. Absolutely"
      },
      {
        "responses": {
          "1": 2,
          "2": 5,
          "3": 3,
          "4": 1,
          "5": 1
        },
        "total": 12,
        "mean": 2.5023,
        "question": "[Course Delivery] Engagement: Did the lecturer present material in an engaging way, which improved your understanding of the course content? 1. No, generally boring 2. Rarely engaging 3. Generally held my attention 4. Engaging 5. Very engaging and often required actively thinking about material 0 0 0 0 0 0 --31. [Recitation or Discussion Section] Was the section effective in increasing your understanding of, and ability to use, the course material? 1. No, usually poorly done 2. Sometimes 3. Usually adequate 4. Usually good 5. Nearly always very good 0 0 0 0 0 0 --41. [Laboratory Section] Lab Activities: How valuable were laboratory activities in enhancing your learning in this course (e.g., taught specific skills, provided experience with real equipment and data, provided hands-on experience, increased my understanding of the material)? 1. Minimal value 2. Occasional value 3. Moderate value 4. Significant value 5. Very valuable, well worth time spent on them 0 0 0 0 0 0 --42. [Laboratory Section] Lab expectations: Were lab expectations (goals, tasks, reports, deadlines, etc.) clear and realistic? 1. Not at all 2. Partially 3. Adequately 4. Usually clear and realistic 5. Almost always very clear and realistic 0 0 0 0 0 0 --43. [Laboratory Section] Lab resources: Were lab resources (equipment, software, information, instructions, etc.) sufficient to provide a positive experience? 1. Rarely sufficient, severely detracted from the experience 2. Sometimes sufficient 3. Usually sufficient 4. Almost always sufficient 5. Excellent resources that enhanced the laboratory experience 0 0 0 0 0 0 --44. [Laboratory Section] Lab Staffing: Support and help, during lab and for lab reports, were sufficient to successfully complete and analyze experiments. 1. Rarely sufficient 2. Partially sufficient 3. Adequate 4. Almost always sufficient 5. Excellent, significantly enhanced the laboratory experience"
      },
      {
        "responses": {
          "1": 0,
          "2": 6,
          "3": 5,
          "4": 1,
          "5": 0
        },
        "total": 12,
        "mean": 2.5851,
        "question": "[Workload, Resources, Assignments & Assessment] Workload: How many hours per week, on average, did you spend doing work associated with this course outside of scheduled class time? 1. <3 hours 2. 3-6 3. 7-10 4. 11-15 5. >15 hours"
      },
      {
        "responses": {
          "1": 2,
          "2": 1,
          "3": 2,
          "4": 6,
          "5": 1
        },
        "total": 12,
        "mean": 3.2552,
        "question": "[Workload, Resources, Assignments & Assessment] Workload Value: The time spent on various assignments (homework, lab reports, coding, projects) was reasonable for the amount it improved my understanding of the course content. 1. Little value relative to the time required 2. Some value 3. Reasonable value for the time spent 4. Good value for time spent 5. Excellent value to time ratio"
      },
      {
        "responses": {
          "1": 0,
          "2": 2,
          "3": 4,
          "4": 4,
          "5": 1
        },
        "total": 11,
        "mean": 3.3653,
        "question": "[Workload, Resources, Assignments & Assessment] Resources: How valuable were outside of class-time resources (e.g., readings, videos, online content, course notes) in building your understanding? 1. Minimal value 2. Occasional value 3. Moderate value 4. Significant value 5. Very valuable, well worth the time spent on them"
      },
      {
        "responses": {
          "1": 1,
          "2": 1,
          "3": 2,
          "4": 2,
          "5": 6
        },
        "total": 12,
        "mean": 3.9254,
        "question": "[Workload, Resources, Assignments & Assessment] Value of Assignments: Independent of the time required, overall, did assignments (e.g., homework, labs, programming assignments, projects, papers, presentations) improve your understanding of, and ability to use, the course concepts and content? 1. Minimally 2. Sometimes 3. Usually 4. Almost always 5. Reliably and significantly increased my understanding and ability"
      },
      {
        "responses": {
          "1": 1,
          "2": 2,
          "3": 4,
          "4": 2,
          "5": 2
        },
        "total": 11,
        "mean": 3.1855,
        "question": "[Workload, Resources, Assignments & Assessment] Exams & Grading: Were exams and grading a fair and reasonable measure of your learning? (Exams: clear, well written, range of content and difficulty. Grading: fair, prompt.) 1. No 2. Significant issues exist 3. Generally fair assessment of my learning 4. Well developed and fair 5. Yes, definitely"
      },
      {
        "responses": {
          "1": 0,
          "2": 0,
          "3": 2,
          "4": 7,
          "5": 2
        },
        "total": 11,
        "mean": 4.0061,
        "question": "[Course Environment] Diversity & Inclusion: To what extent have the professors and teaching staff fostered an inclusive environment such that the class is welcoming to all, everyone is encouraged to participate, none are made to feel different, and all are treated fairly? 1. Extremely non-inclusive with inappropriate comments and/or behaviors 2. Actively not inclusive with certain students ignored, left out, or treated dismissively 3. Passively not inclusive; comments or contributions by some students are valued less than those of other students 4. Passively inclusive where everyone is welcome to participate. Nothing specific to encourage or discourage anyone. 5. Actively inclusive, all are fully encouraged to participate and are supported"
      },
      {
        "responses": {
          "1": 1,
          "2": 3,
          "3": 2,
          "4": 4,
          "5": 1
        },
        "total": 11,
        "mean": 3.0962,
        "question": "[Course Environment] Access to Assistance: Was there sufficient access to assistance (through office hours, online forums, in-class or section questions and/or activities, special accommodations met, etc.)? 1. Almost no access and/or help was ineffective 2. Limited access or value 3. Acceptable access and help 4. Good access with quality help 5. Abundantly available high quality help"
      },
      {
        "responses": {
          "1": 0,
          "2": 0,
          "3": 3,
          "4": 5,
          "5": 3
        },
        "total": 11,
        "mean": 4.0063,
        "question": "[Course Environment] Academic Integrity: Was the code of academic integrity maintained in the class (e.g. with respect to cheating, copying, plagiarism, use of unauthorized sources, etc.)? 1. Blatant disregard for Academic Integrity 2. No. Violations clearly occurred that were not addressed. 3. Not strongly. Violations could well have occurred (even if I am not aware of any). 4. Yes. Instructor took reasonable steps to maintain academic integrity. 5. Yes. Academic integrity was clearly and intentionally maintained. 0 1 1 1 -- 3 3.0064. [COVID-19 Support] If you were diagnosed with Covid-19, or had to quarantine this semester due to symptoms or exposure, did you feel supported as far as staying connected with the class and making up any missed work? 1. No, I did not feel supported. 2. Somewhat. Deadlines were extended but I didn't have a way to learn lecture material. 3. Yes, I did receive support. I was provided with a way to access content remotely if needed. Deadlines were considered and may have been extended. 4. Yes, I felt very supported with an appropriate mix of accessible content, an opportunity to participate in office hours and/or get help, and extensions and make-ups when needed. 5. Not applicable."
      },
      {
        "responses": {
          "1": 2,
          "2": 3,
          "3": 2,
          "4": 4,
          "5": 1
        },
        "total": 12,
        "mean": 2.9291,
        "question": "[Comparison to Other Courses] Instructor: Rate the overall teaching effectiveness of your lecturer compared to others at Cornell. 1 = Worse than average 5 = Much better than average"
      },
      {
        "responses": {
          "1": 1,
          "2": 4,
          "3": 3,
          "4": 2,
          "5": 2
        },
        "total": 12,
        "mean": 3.0092,
        "question": "[Comparison to Other Courses] Course: Overall, how does this course compare with other comparable (technical or non-technical, as appropriate) courses you've taken at Cornell? 1 = Poorly, not educational 5 = Excellently, extremely educational"
      }
    ],
    "file_path": "/Users/ronaldjabouin/Documents/ProfessorPeek/backend/course-evals/Spring 2022/BEE/BEE_BEE_4760_Lec_1-Hai.pdf",
    "subject": "BEE"
  }
]
